
//**************************************************************************************************
// Get a Cookie
//**************************************************************************************************

function cookieGet(cname) {
    let name = cname + "=";
    let decodedCookie = decodeURIComponent(document.cookie);
    let ca = decodedCookie.split(';');
    for (let i = 0; i < ca.length; i++) {
        let c = ca[i];
        while (c.charAt(0) == ' ') {
            c = c.substring(1);
        }
        if (c.indexOf(name) == 0) {
            return c.substring(name.length, c.length);
        }
    }
    return "";
}

//**************************************************************************************************
//**************************************************************************************************
// Главное меню
//**************************************************************************************************
//**************************************************************************************************

//**************************************************************************************************
// Показ / Скрытие меню на мобильных устройствах
//**************************************************************************************************

function navbarBtnClick(elm) {
    elm.blur();
    document.getElementById("collapse").classList.toggle("show");
}

//**************************************************************************************************
// Показ / Скрытие меню вложенных
// Показ / Скрытие меню у кнопки
//**************************************************************************************************

function navbarLinkClick(elm) {
    var elmDropdown = elm.parentNode.querySelector(".dropdown-menu");
    // Остальные скрыть
    var elms = document.getElementsByClassName("dropdown-menu");
    Array.from(elms).forEach((elm) => {
        if (elm != elmDropdown) {
            elm.classList.remove("show");
        }
    });
    // Кликнутое показать / скрыть
    if (elmDropdown) {
        elmDropdown.classList.toggle("show");
    }
}

//**************************************************************************************************
// Скрытие меню вложенных при клике мимо меню
// Скрытие меню у кнопки при клике мимо меню
//**************************************************************************************************

document.addEventListener("click", function(event) {
    // Поиск открытого меню вложенного
    var elmShowing = null;
    var elms = document.getElementsByClassName("dropdown-menu");
    Array.from(elms).forEach((elm) => {
        if (elm.classList.contains("show")) {
            elmShowing = elm;
        }
    });
    // Скрытие меню вложенного, если клик не по его пункту из меню верхнего уровня
    if (elmShowing) {
        if ( !elmShowing.parentNode.contains(event.target) && !elmShowing.contains(event.target) ) {
            elmShowing.classList.remove("show");
        }
    }
});

//**************************************************************************************************
//**************************************************************************************************
//**************************************************************************************************
